test/system/air/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
    // Cathode
    {
        name    cathodeCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 0.0e-3 4.999e-3) (50.0e-3 4.0e-3 5.291e-3);
    }
    {
        name    cathode;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     cathodeCellSet;
    }
    
);


// ************************************************************************* //
