test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
// ... From Bottom To Top

// Interconnect0
	( 0 0 0) // 0
	(50 0 0) // 1
	(50 4 0) // 2
	( 0 4 0) // 3

// Interconnect0_to_Air
	( 0 0 3.5) // 4
	(50 0 3.5) // 5
	(50 4 3.5) // 6
	( 0 4 3.5) // 7

// Air_to_cathode
	( 0 0 5.0) // 8
	(50 0 5.0) // 9
	(50 4 5.0) //10
	( 0 4 5.0) //11

// cathode_to_Electrolyte
	( 0 0 5.29) //12
	(50 0 5.29) //13
	(50 4 5.29) //14
	( 0 4 5.29) //15

// Electrolyte_to_anode
	( 0 0 5.3) //16
	(50 0 5.3) //17
	(50 4 5.3) //18
	( 0 4 5.3) //19

// anode_to_Fuel
	( 0 0 6.3) //20
	(50 0 6.3) //21
	(50 4 6.3) //22
	( 0 4 6.3) //23

// fuel_to_Interconnect1
	( 0 0 7.8) //24
	(50 0 7.8) //25
	(50 4 7.8) //26
	( 0 4 7.8) //27

// Interconnect1
	( 0 0 11.3) //28
	(50 0 11.3) //29
	(50 4 11.3) //30
	( 0 4 11.3) //31
);

blocks
(
// Interconnect0
	hex (0 1 2 3 4 5 6 7) (25 8 7) simpleGrading (1 1 1)
// air
	hex (4 5 6 7 8 9 10 11) (25 8 3) simpleGrading (1 1 1)
// cathode
	hex (8 9 10 11 12 13 14 15) (25 8 1) simpleGrading (1 1 1)
// electrolyte
	hex (12 13 14 15 16 17 18 19) (25 8 1) simpleGrading (1 1 1)
// anode
	hex (16 17 18 19 20 21 22 23) (25 8 2) simpleGrading (1 1 1)
// fuel
	hex (20 21 22 23 24 25 26 27) (25 8 3) simpleGrading (1 1 1)
// Interconnect1
	hex (24 25 26 27 28 29 30 31) (25 8 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
//Interconnect0
    interconnect0Bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    interconnect0Sides
    {
    	type patch;
    	faces
    (
	    (0 1 5 4)
	    (3 7 6 2)
	    (0 4 7 3)
	    (1 2 6 5)
    );
    }

//Air
    airInlet
    {
    	type patch;
    	faces
    (
	    (4 8 11 7)
    );
    }
    airOutlet
    {
    	type patch;
    	faces
    (
	    (5 6 10 9)
    );
    }
    airSides
    {
    	type patch;
    	faces
    (
	    (4 5 9 8)
	    (7 11 10 6)
    );
    }

//Cathode
    cathodeSides
    {
    	type patch;
    	faces
    (
	    (8 9 13 12)
	    (11 15 14 10)
	    (8 12 15 11)
	    (9 10 14 13)
    );
    }

//Electrolyte
    electrolyteSides
    {
    	type patch;
    	faces
    (
	   (12 13 17 16)
	   (15 19 18 14)
	   (12 16 19 15)
	   (13 14 18 17)
    );
    }
    
//Anode
    anodeSides
    {
    	type patch;
    	faces
    (
	   (16 17 21 20)
	   (19 23 22 18)
	   (16 20 23 19)
	   (17 18 22 21)
    );
    }
    
//Fuel    
    fuelInlet
    {
    	type patch;
    	faces
    (
	    (20 24 27 23)
    );
    }
    fuelOutlet
    {
    	type patch;
    	faces
    (
	    (21 22 26 25)
    );
    }
    fuelSides
    {
    	type patch;
    	faces
    (
	    (20 21 25 24)
	    (23 27 26 22)
    );
    }
    
//Interconnect1
    interconnect1Top
    {
        type patch;
        faces
        (
            (28 29 30 31)
        );
    }
    interconnect1Sides
    {
    	type patch;
    	faces
    (
	    (24 28 31 27)
	    (25 26 30 29)
	    (24 25 29 28)
	    (27 31 30 26)
    );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
