test/system/fuel/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*boundary
{
    fuelInlet
    {
        inGroups        (coupleGroup);
    }
}*/

U
{
    internalField   uniform (0 0 0);

    boundaryField
    {
        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
        fuelInlet
        {
            type            fixedValue;
            value           uniform (1.0 0 0);
        }
        fuelOutlet
        {
            type            zeroGradient;
        }
    }
}

T
{
    internalField   uniform 1000;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        fuelInlet
        {
            type            fixedValue;
            value           uniform 1000;
        }
        fuelOutlet
        {
            type            zeroGradient;
        }

        "fuel_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 1000;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;

    boundaryField
    {
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }

        fuelInlet
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        fuelOutlet
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {
        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }

        fuelInlet
        {
            type            fixedValue;
            value           uniform 0.1;
        }
        fuelOutlet
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 101325;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        fuelOutlet
        {
            type            fixedValue;
            value           uniform 101325;
        }
        
        "fuel_to_.*"
        {
            type	    fixedFluxPressure;
            value	    uniform 0;
        }
    }
}

p
{
    internalField   uniform 101325;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 101325;
        }

        fuelOutlet
        {
            type            calculated;
            value           uniform 101325;
        }
    }
}

H2
{
    internalField   uniform 0.782;

    boundaryField
    {
        ".*"
        {
	    type            zeroGradient;
        }

        fuelInlet
        {
            type            fixedValue;
            value           $internalField;
        }
        
        fuel_to_electrolyte
        {
            type            outletInlet;
            value      uniform 0;
            outletValue	    $internalField;
        }
    }
}

H2O
{
    internalField   uniform 0.218;

    boundaryField
    {
        ".*"
        {
	    type            zeroGradient;
        }

        fuelInlet
        {
            type            fixedValue;
            value           $internalField;
        }
        
        fuel_to_electrolyte
        {
            type            fixedValue;
            value           uniform 0.4;
        }
    }
}
// ************************************************************************* //
